content-org/o.org
* Gears
:PROPERTIES:
:EXPORT_FILE_NAME: gears
:EXPORT_HUGO_SECTION: docs/tools
:END:
** Who am I?
I am a developer with a wide variety of interests. I am trying to build a large volume of things and also get my fundamentals right. Unfortunately after all these years, I still am in the discovery phase and I guess that's alright.

I am trying to build a large volume of things not because I want to see what sticks on the wall but because I think that's a good way to discover and experiment in the respective domain and I get to have ton of fun along the way. I'll also be actively studying and researching these areas.

** Working Setup
#+attr_html: :class book-hint info
#+begin_quote
I am feeling particularly lazy as I write this. will come back later someday and fill things in.
#+end_quote

*** Hardware
My primary development machine is ThinkPad E480 with some customizations, I've been using it for the last 3 years without any hardware issues. Recently I built my PC and bought a monitor so that it increases my productivity. The monitor is definitely helping but I am not sure about the PC. I planned to game on it but have not started gaming yet.
*** Software
I use arch btw. See [[*Primary tool-chest][primary tool chest]] for list of packages.
*** Security
I carry a picture of a knife on my phone with me all the time. robbers be-aware. For password management, I used to use pass but then I switched to bitwarden. I am planning to move to selfhosted one soon. I need easy access to my password from my phone, atleast
at the moment.
*** Phone
I use an one plus 9. It's been a good phone to me so far. I'll probably fill more details later.
** Know more about my system
I run my systems, but i hardly have scrached the capabilities of my system, I shall dump relevant links which will help me undertand my systems better here. Make sure to clean up this list and summarize the learnings in some way.
- [[https://betterprogramming.pub/save-your-linux-machine-from-certain-death-24ced335d969][Save Your Linux Machine From Certain Death]]
- [[https://wiki.archlinux.org/title/improving_performance#RAM,_swap_and_OOM_handling][Improving performance - ArchWiki]]
- [[https://people.kernel.org/monsieuricon/what-does-a-pgp-signature-on-a-git-commit-prove][What does a PGP signature on a git commit prove?]]
- [[https://codeahoy.com/2017/01/20/hhtop-explained-visually/][htop Explained Visually | CodeAhoy]]
- [[https://robertodip.com/blog/managing-processes-with-htop/][Managing processes with htop]]
- [[https://peteris.rocks/blog/htop/][htop explained | peteris.rocks]]
- [[https://ablagoev.github.io/linux/adventures/commands/2017/02/19/adventures-in-usr-bin.html][Adventures in /usr/bin and the likes]]
- [[https://utcc.utoronto.ca/~cks/space/blog/unix/FindWithoutXargsToday][Chris's Wiki - blog/unix/FindWithoutXargsToday]]
