content/docs/tools/gears.md
+++
title = "Gears"
author = ["Hrishikesh Barman"]
draft = false
+++

## Who am I? {#who-am-i}

I am a developer with a wide variety of interests. I am trying to build a large volume of things and also get my fundamentals right. Unfortunately after all these years, I still am in the discovery phase and I guess that's alright.

I am trying to build a large volume of things not because I want to see what sticks on the wall but because I think that's a good way to discover and experiment in the respective domain and I get to have ton of fun along the way. I'll also be actively studying and researching these areas.


## Working Setup {#working-setup}

<div class="book-hint info">

> I am feeling particularly lazy as I write this. will come back later someday and fill things in.
</div>


### Hardware {#hardware}

My primary development machine is ThinkPad E480 with some customizations, I've been using it for the last 3 years without any hardware issues. Recently I built my PC and bought a monitor so that it increases my productivity. The monitor is definitely helping but I am not sure about the PC. I planned to game on it but have not started gaming yet.


### Software {#software}

I use arch btw. See [primary tool chest]({{< relref "primary_toolchest" >}}) for list of packages.


### Security {#security}

I carry a picture of a knife on my phone with me all the time. robbers be-aware. For password management, I used to use pass but then I switched to bitwarden. I am planning to move to selfhosted one soon. I need easy access to my password from my phone, atleast
at the moment.


### Phone {#phone}

I use an one plus 9. It's been a good phone to me so far. I'll probably fill more details later.


## Know more about my system {#know-more-about-my-system}

I run my systems, but i hardly have scrached the capabilities of my system, I shall dump relevant links which will help me undertand my systems better here. Make sure to clean up this list and summarize the learnings in some way.

-   [Save Your Linux Machine From Certain Death](https://betterprogramming.pub/save-your-linux-machine-from-certain-death-24ced335d969)
-   [Improving performance - ArchWiki](https://wiki.archlinux.org/title/improving_performance#RAM,_swap_and_OOM_handling)
-   [What does a PGP signature on a git commit prove?](https://people.kernel.org/monsieuricon/what-does-a-pgp-signature-on-a-git-commit-prove)
-   [htop Explained Visually | CodeAhoy](https://codeahoy.com/2017/01/20/hhtop-explained-visually/)
-   [Managing processes with htop](https://robertodip.com/blog/managing-processes-with-htop/)
-   [htop explained | peteris.rocks](https://peteris.rocks/blog/htop/)
-   [Adventures in /usr/bin and the likes](https://ablagoev.github.io/linux/adventures/commands/2017/02/19/adventures-in-usr-bin.html)
-   [Chris's Wiki - blog/unix/FindWithoutXargsToday](https://utcc.utoronto.ca/~cks/space/blog/unix/FindWithoutXargsToday)
